/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: shan <shan@student.42seoul.kr>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/06/29 15:48:47 by shan              #+#    #+#             */
/*   Updated: 2022/06/29 16:07:03 by shan             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "./minilibx-linux/mlx.h"

int main()
{
	void *mlx_ptr;//mlx를 사용하기 위한 변수
	void *win_ptr;//윈도우를 띄우도록 하는 함수를 받는 변수?

	mlx_ptr = mlx_init();//시작설정을 mlx_ptr에 저장
	win_ptr = mlx_new_window(mlx_ptr, 500, 500, "mlx 42");//초기화된 변수 /좌, 우 해상도 / 타이틀 등을 매개변수로 받아 창을 생성
	mlx_loop(mlx_ptr);//종료되지않고 창을 계속 띄울 수 있도록 루프를 걸어둠 
}
